trade_exp/src/Documents/СторноПоАннулированнымЛистам/СторноПоАннулированнымЛистам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7ca7cf10-0cc4-4cf4-84c6-612941e02e8f">
  <name>СторноПоАннулированнымЛистам</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8f5b3b66-eb3a-430b-a0cf-23b12e290f62">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="40fb35ea-e4ba-4119-b1d6-3b1c1a368bb8">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e23f7e90-3a9c-41ee-a008-e96fdfbabd6f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="47c5a54d-c150-4849-8e70-375419c407ea">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="43cd3a44-4e73-4526-b4f3-f4e1cc231858">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c540cfeb-934e-42e3-ae36-dfddb8b579bb">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="68221aab-86b5-4a9a-8a53-6342ad1b13f2">
      <name>Сторно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b73dcae7-2745-4b88-a714-8cbe27dfd4d1">
      <name>РегистраторУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/СторноПоАннулированнымЛистам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СторноПоАннулированнымЛистам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"СторноПоАннулированнымЛистам", НСтр("ru = 'Сторно по аннулированным листам'"), СформироватьПечатнуюФорму(МассивОбъектов));
	КонецЕсли;
КонецПроцедуры

Функция ЗапросФормированиеПечатнойФормы(СсылкаНаДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Номер КАК Номер,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Дата КАК Дата,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Автор КАК Автор,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Комментарий КАК Комментарий,
	|	СторноПоАннулированнымЛистамНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(СторноПоАннулированнымЛистамНачисления.Сторно) КАК СуммаСторно,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка КАК Ссылка,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.СторноПоАннулированнымЛистам.Начисления КАК СторноПоАннулированнымЛистамНачисления
	|ГДЕ
	|	СторноПоАннулированнымЛистамНачисления.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Дата,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Автор,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Комментарий,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Номер,
	|	СторноПоАннулированнымЛистамНачисления.Сотрудник,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СторноПоАннулированнымЛистамНачисления.Сотрудник.Наименование
	|ИТОГИ
	|	СУММА(СуммаСторно)
	|ПО
	|	Ссылка" ;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	Возврат Выборка;
КонецФункции

Функция СформироватьПечатнуюФорму  (СсылкаНаДокумент) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("СторноПоАннулированнымЛистам");
	
	ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("Заголовок");
	ОбластьНачисленияШапка = МакетОбработки.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = МакетОбработки.ПолучитьОбласть("Начисления");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	
Для каждого Ссылка из СсылкаНаДокумент Цикл			
		Выборка = ЗапросФормированиеПечатнойФормы(Ссылка.Ссылка);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисленияШапка.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисления.Параметры,Выборка);
	 		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,Выборка);	
			ТабличныйДокумент.Очистить();

				
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок,Выборка.Уровень());


		ТабличныйДокумент.Вывести(ОбластьНачисленияШапка);
		Ном=1;
		ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ОбластьНачисления.Параметры.НомерСтроки= Ном;  
			ТабличныйДокумент.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
			Ном=Ном+1;
		КонецЦикла;
	

		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);

			КонецЦикла;
		КонецЦикла;
	Возврат ТабличныйДокумент;

КонецФункции

#КонецЕсли
